{
    "deans-list-winter-2022": {
        "name": "Winter 2022 University of Toronto Engineering Dean's Honour List",
        "date": "TBA",
        "description": "This designation is given to students in Faculty of Applied Science and Engineering having a weighted term average of 79.5% or higher in the Winter 2022 semester."
    },
    "deans-list-fall-2021": {
        "name": "Fall 2021 University of Toronto Engineering Dean's Honour List",
        "date": "Apr 2022",
        "description": "This desgination is given to students in Faculty of Applied Science and Engineering having a weighted term average of 79.5% or higher in the Fall 2021 semester."
    },
    "edward-s-rogers-sr-admission-scholarship": {
        "name": "Edward S Rogers Sr. Admission Scholarship",
        "date": "Oct 2021",
        "description": "Received this scholarship based on my academic achievements and extracurricular activities entering Electrical and Computer Engineering." 
    },
    "euclid-contest": {
        "name": "School Champion of Euclid Math Contest",
        "date": "Jun 2021",
        "description": "The School Champion of 2021 Euclid Math Contest at Holy Trinity Catholic Secondary School." 
    },
    "scholar": {
        "name": "Ontario Scholar",
        "date": "Jun 2021",
        "description": "Ontario Scholars are high school graduates in the Canadian province of Ontario who attain an average of 80% or greater in their six best Grade 12 courses."
    },
    "awards-of-excellence": {
        "name": "Award of Excellence in Grade 9, 10, 11, and 12",
        "date": "Sep 2017 - Jun 2021",
        "description": "Demonstrated academic excellence by maintain above a 90% average throughout all 4 years of high school"
    },
    "subject-awards": {
        "name": "Various Subject Awards",
        "date": "Jun 2021",
        "description": "Received the highest mark in Grade 12 AP Advanced Functions (MHF4UA), AP Calculus and Vectors (MCV4UA), AP Physics (SPH4UA), and U level Computer Science (ICS4U1)"
    },
    "pascal-contest": {
        "name": "School Champion of Pascal Math Contest",
        "date": "Nov 2018",
        "description": "The School Champion of 2018 Pascal Math Contest at Holy Trinity Catholic Secondary School."
    },
    "cimc-contest": {
        "name": "School Champion of CIMC Math Contest",
        "date": "Nov 2018",
        "description": "The School Champion of 2018 CIMC Math Contest at Holy Trinity Catholic Secondary School."
    }
}